print("Half-life вы ученый Гордон Фриман Вам 27 лет у вас 3 уровень вам надо одеть костюм охранник так сказал")
x =int(input("выбор:ударить охрану,пойти в раздевалку"))
if x == 1:
    print("охранник достал ствол и застрелил вас")
if x == 2:
    print("вы пошли в раздевалку одели костюм пошли в главный кабинет учёные сказали что реактор готов к запуску но под сомнением вы пошли запускать реактор но что то пошло не так и повсюду начали поевлятся порталы неизвестных сущностей и вы потеряли сознание.")
print("после того как вы очнулись вы поняли что произашел каскатный резонанс вы выходите и видите учёного который говорит что нужно выбратся на поверхность вы идёте и видете лежащюю монтировку вы её берёте с собой и ломайте стекло что мешало пройти вам потом вы подходите к лифту")
y = int(input("выбор:нажать кнопку чтобы вызвать лифт,сломать мешающее стекло ломом"))
if y == 1:
        print("лифт свалился с тремя учеными вы сломали стекло и пошли вверх по лестнице")
if y == 2:
        print("вы разбили мешающее стекло и поднялись по лестнице")
print("вы идёте и вдруг на вас резко прыгает паразит вы его убивайте")